# Exploratory Data Analysis for the Mall Customers dataset

## Dependencies

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## Loading DataFrame

In [3]:
df = pd.read_csv("mall-customers.csv")

In [16]:
df = pd.read_csv("mall-customers.csv")

is_male = df["is_male"].values
income = df["annual-income"].values
score = df["spending-score"].values
age = df["age"].values

## DataFrame structure

In [4]:
df.shape

(200, 4)

In [ ]:
df.head

<bound method NDFrame.head of      is_male  age  annual-income  spending-score
0          1   19             15              39
1          1   21             15              81
2          0   20             16               6
3          0   23             16              77
4          0   31             17              40
..       ...  ...            ...             ...
195        0   35            120              79
196        0   45            126              28
197        1   32            126              74
198        1   32            137              18
199        1   30            137              83

[200 rows x 4 columns]>

In [ ]:
df.isnull().sum()  # checking integrity

is_male           0
age               0
annual-income     0
spending-score    0
dtype: int64

In [14]:
df.drop('is_male', axis=1).describe()

              age  annual-income  spending-score
count  200.000000     200.000000      200.000000
mean    38.850000      60.560000       50.200000
std     13.969007      26.264721       25.823522
min     18.000000      15.000000        1.000000
25%     28.750000      41.500000       34.750000
50%     36.000000      61.500000       50.000000
75%     49.000000      78.000000       73.000000
max     70.000000     137.000000       99.000000